In [1]:
import numpy as np
import pandas as pd

In [2]:
raw_data = {'Company' : ['GOOG','GOOG','MSFT','MSFT','TSLA','TSLA'],
            'Person' : ['Tony', 'Bruce', 'Steve', 'Natalie', 'Clint', 'Thor'],
            'Sales' : [175000, 120000, 13500, 15200, 51000, 100] }

In [3]:
df = pd.DataFrame(raw_data)

In [4]:
df

  Company   Person   Sales
0    GOOG     Tony  175000
1    GOOG    Bruce  120000
2    MSFT    Steve   13500
3    MSFT  Natalie   15200
4    TSLA    Clint   51000
5    TSLA     Thor     100

In [5]:
Goog = df.groupby('Company')

In [7]:
Goog.mean()

          Sales
Company
GOOG     147500
MSFT      14350
TSLA      25550

In [8]:
Goog.sum()

          Sales
Company
GOOG     295000
MSFT      28700
TSLA      51100

In [9]:
Goog.std()

                Sales
Company
GOOG     38890.872965
MSFT      1202.081528
TSLA     35991.735162

In [29]:
Goog.sum().loc['GOOG']

Sales    295000
Name: GOOG, dtype: int64

In [32]:
df.groupby('Company').count()

         Person  Sales
Company
GOOG          2      2
MSFT          2      2
TSLA          2      2

In [36]:
df.groupby('Company').min()

          Person   Sales
Company
GOOG       Bruce  120000
MSFT     Natalie   13500
TSLA       Clint     100

In [40]:
df.groupby('Company').describe().transpose()

Company               GOOG          MSFT          TSLA
Sales count       2.000000      2.000000      2.000000
      mean   147500.000000  14350.000000  25550.000000
      std     38890.872965   1202.081528  35991.735162
      min    120000.000000  13500.000000    100.000000
      25%    133750.000000  13925.000000  12825.000000
      50%    147500.000000  14350.000000  25550.000000
      75%    161250.000000  14775.000000  38275.000000
      max    175000.000000  15200.000000  51000.000000

In [41]:
df.groupby('Company').describe()

        Sales                                                                  \
        count      mean           std       min       25%       50%       75%
Company
GOOG      2.0  147500.0  38890.872965  120000.0  133750.0  147500.0  161250.0
MSFT      2.0   14350.0   1202.081528   13500.0   13925.0   14350.0   14775.0
TSLA      2.0   25550.0  35991.735162     100.0   12825.0   25550.0   38275.0


              max
Company
GOOG     175000.0
MSFT      15200.0
TSLA      51000.0

In [51]:
df.groupby('Company').describe().max()

Sales  count         2.000000
       mean     147500.000000
       std       38890.872965
       min      120000.000000
       25%      133750.000000
       50%      147500.000000
       75%      161250.000000
       max      175000.000000
dtype: float64